[
  {
    "doc_id": "en_000000",
    "title": "How people with diabetes can fast safely during Ramadan",
    "body": "People with diabetes can observe fasting during Ramadan safely by following certain guidelines and taking proper prior preparation. Diabetic patients are advised to consult a physician at least two to three months before the start of Ramadan to adjust their lifestyle and treatment plans accordingly. This information was shared at a press conference organized by Association of Clinical... Details",
    "url": "https://www.dhakatribune.com/business/399481/how-people-with-diabetes-can-fast-safely-during",
    "date": "Wed, 24 Dec 2025 18:40:28 +0600",
    "language": "en",
    "token_count": 59
  },
  {
    "doc_id": "en_000001",
    "title": "Jamuna Bank, Hotel Best Western Plus Bay Hills, Cox’s Bazar ink deal",
    "body": "Jamuna Bank PLC signed a corporate agreement with Best Western Plus Bay Hills, Cox’s Bazar Dhaka on December 9 at Jamuna Bank Tower, Gulshan-1, Dhaka. The agreement was formally signed by Noor Mohammed, deputy managing director & CBO of Jamuna Bank PLC, and Tajuddin Mahmood, deputy managing director of Best Western Plus Bay Hills, in the presence of AKM Atiqur Rahman, deputy managing... Details",
    "url": "https://www.dhakatribune.com/business/banks/399480/jamuna-bank-hotel-best-western-plus-bay-hills",
    "date": "Wed, 24 Dec 2025 18:37:45 +0600",
    "language": "en",
    "token_count": 64
  },
  {
    "doc_id": "en_000002",
    "title": "Walton, Intel hold Tech Gala Night",
    "body": "To further strengthen Bangladesh’s technology business ecosystem, once again, a grand “Walton–Intel Tech Gala Night” was held in Dhaka. The event was jointly hosted by US-based global technology giant Intel and Bangladesh’s leading technology brand Walton Computer, bringing together key business partners from across the sector. At the gala night, Walton and Intel... Details",
    "url": "https://www.dhakatribune.com/business/399479/walton-intel-hold-tech-gala-night",
    "date": "Wed, 24 Dec 2025 18:35:46 +0600",
    "language": "en",
    "token_count": 54
  },
  {
    "doc_id": "en_000003",
    "title": "AB Bank opens sub-branch in Noahkhali",
    "body": "AB Bank PLC inaugurated its Kankirhat sub-branch on Wednesday as the 60th sub-branch of the bank. The sub-branch is located at Bhuiyan Market, Birkot, Kesharpar, Senbug, Noakhali. Reazul Islam, managing director and CEO (acting) at AB Bank, inaugurated the sub-branch through video conference from bank’s head office. Senior officials of the bank were also present on the occasion. Details",
    "url": "https://www.dhakatribune.com/business/banks/399473/ab-bank-opens-sub-branch-in-noahkhali",
    "date": "Wed, 24 Dec 2025 18:06:45 +0600",
    "language": "en",
    "token_count": 59
  },
  {
    "doc_id": "en_000004",
    "title": "Bonik Barta, BIDS hold ‘Gunijon Songbordhona 2025’",
    "body": "The “Gunijon Songbordhona 2025,” jointly organised by Bonik Barta and the Bangladesh Institute of Development Studies (BIDS), was held on December 23 at the Radisson Blu Hotel in the capital. This year, three eminent personalities of the country are being honoured: Syed Manzur Elahi (posthumously), Dr. Firdausi Qadri, and Professor Dr. Amirul Islam Chowdhury. Syed Manzur Elahi, a... Details",
    "url": "https://www.dhakatribune.com/business/399465/bonik-barta-bids-hold-%E2%80%98gunijon-songbordhona-2025%E2%80%99",
    "date": "Wed, 24 Dec 2025 16:32:40 +0600",
    "language": "en",
    "token_count": 59
  },
  {
    "doc_id": "en_000005",
    "title": "Al-Arafah Islami Bank holds centralized account opening program at 50th branch",
    "body": "Al-Arafah Islami Bank, the country's leading Sharia-compliant Bank, is continuously implementing strategic transformation programs to implement fully centralized banking operations. As part of this, the bank has successfully brought account opening services under the centralization program at its 50th branch. This is an important milestone in the bank's digital and operational development.... Details",
    "url": "https://www.dhakatribune.com/business/banks/399462/al-arafah-islami-bank-holds-centralized-account",
    "date": "Wed, 24 Dec 2025 16:23:08 +0600",
    "language": "en",
    "token_count": 53
  },
  {
    "doc_id": "en_000006",
    "title": "‘Korean firms want more investment opportunities in Bangladesh’",
    "body": "The outgoing South Korean Ambassador to Bangladesh Park Young-sik, in an exclusive interview with Dhaka Tribune Editor Reaz Ahmad, reflects on his time in Dhaka and discusses why the two Asian countries should seal a trade deal sooner rather than later. Details",
    "url": "https://www.dhakatribune.com/business/399461/%E2%80%98korean-firms-want-more-investment-opportunities",
    "date": "Wed, 24 Dec 2025 16:11:19 +0600",
    "language": "en",
    "token_count": 42
  },
  {
    "doc_id": "en_000007",
    "title": "Midland Bank, Marco Polo Dhaka Hotel ink MoU",
    "body": "Midland Bank PLC signed a Memorandum of Understanding (MoU) with Marco Polo Dhaka Hotel on December 15. Marco Polo Dhaka Hotel is a well-known hotel located in Dhaka, offering a wide range of accommodations and amenities for both business and leisure travelers. The MoU signing ceremony was held at Midland Bank PLC.’s Head Office in Gulshan-2, Dhaka. Md Nazmul Huda Sarkar, CTO of... Details",
    "url": "https://www.dhakatribune.com/business/banks/399357/midland-bank-marco-polo-dhaka-hotel-ink-mou",
    "date": "Mon, 22 Dec 2025 23:19:28 +0600",
    "language": "en",
    "token_count": 64
  },
  {
    "doc_id": "en_000008",
    "title": "‘Father of Hospitality’: Why we must fight for its freedom",
    "body": "Hospitality is frequently reduced to a narrow service function, confined to hotels, restaurants, and tourism. Yet, according to Bangladeshi hospitality pioneer Iqramlemagne, widely regarded as the ‘Father of Hospitality,’ such a view fundamentally misunderstands its true significance. Hospitality, he argues, is not merely an industry but a core human value—a social system... Details",
    "url": "https://www.dhakatribune.com/business/399355/%E2%80%98father-of-hospitality%E2%80%99-why-we-must-fight-for-its",
    "date": "Mon, 22 Dec 2025 23:04:26 +0600",
    "language": "en",
    "token_count": 53
  },
  {
    "doc_id": "en_000009",
    "title": "Russia emphasizes cooperation with Bangladesh in culture, education, and science",
    "body": "The Russian Ambassador to Bangladesh on Monday held a year-end press conference summarizing the results of 2025, highlighting the dynamic development of Russian–Bangladeshi cooperation in culture, education, and science. During the event, the Director of the Russian House in Dhaka Alexandra Khlevnoy presented the key projects successfully implemented by the Russian House throughout the... Details",
    "url": "https://www.dhakatribune.com/business/399328/russia-emphasizes-cooperation-with-bangladesh-in",
    "date": "Mon, 22 Dec 2025 17:51:11 +0600",
    "language": "en",
    "token_count": 55
  },
  {
    "doc_id": "en_000010",
    "title": "Southeast Bank holds foundation course for trainee assistant officers",
    "body": "Southeast Bank PLC organized a foundation training course for its newly appointed trainee assistant officers (cash). The sessions were conducted by the experienced trainers from Bangladesh Bank along with in-house resource persons. Md Khaled Mahmood Khan, managing director of Southeast Bank PLC, concluded the training program with his valuable speech and awarded certificates to the... Details",
    "url": "https://www.dhakatribune.com/business/banks/399317/southeast-bank-holds-foundation-course-for-trainee",
    "date": "Mon, 22 Dec 2025 16:07:05 +0600",
    "language": "en",
    "token_count": 56
  },
  {
    "doc_id": "en_000011",
    "title": "Over 24,000C revenue deficit despite 15% collection growth",
    "body": "The National Board of Revenue (NBR) failed to meet its target despite achieving a 15.25% growth in revenue collection in the first five months (July-November) of the current FY26. During this period, the revenue collection deficit stood at Tk24,047.55 crore. According to the NBR's statistics department, the total revenue collection in the five months was Tk148,976 crore. However, the revenue... Details",
    "url": "https://www.dhakatribune.com/business/399303/over-24-000c-revenue-deficit-despite-15%25",
    "date": "Mon, 22 Dec 2025 12:49:34 +0600",
    "language": "en",
    "token_count": 61
  },
  {
    "doc_id": "en_000012",
    "title": "Bangladesh Brand Forum awards most loved brands of Bangladesh",
    "body": "Bangladesh Brand Forum honored the Best Brand Award for the 17th consecutive year by arranging a Grand Gala ceremony at the Le Méridien Dhaka on December 20. This year, the award was presented to 45 brands under 45 distinguished categories. The overall top 15 most loved brands of Bangladesh were also identified and awarded. Additionally, the Most Emerging Brand of Bangladesh—AMA... Details",
    "url": "https://www.dhakatribune.com/business/399281/bangladesh-brand-forum-awards-most-loved-brands-of",
    "date": "Sun, 21 Dec 2025 22:49:53 +0600",
    "language": "en",
    "token_count": 62
  },
  {
    "doc_id": "en_000013",
    "title": "Kazi Farms Kitchen top frozen food brand for 4th straight year",
    "body": "Kazi Farms Kitchen has once again been recognized as the No. 1 Frozen Food Brand in Bangladesh at the 17th Best Brand Award 2025, marking a fourth consecutive win in this category. The award ceremony, organized by Bangladesh Brand Forum, was held on December 20 at the Grand Ballroom of Le Méridien Dhaka, in the presence of corporate leaders and other industry stakeholders. This... Details",
    "url": "https://www.dhakatribune.com/business/399266/kazi-farms-kitchen-top-frozen-food-brand-for-4th",
    "date": "Sun, 21 Dec 2025 20:17:57 +0600",
    "language": "en",
    "token_count": 65
  },
  {
    "doc_id": "en_000014",
    "title": "Ispahani Mirzapore wins ‘Best Tea Brand’ for 11 consecutive years",
    "body": "Ispahani Mirzapore has once again been awarded the “Best Hot Beverage Brand (Tea) Award 2025,” setting a new record by winning the title for the eleventh consecutive year. Adding to this achievement, the brand also secured a place among the top four brands in the “Overall Best Brand” category, competing with leading local and multinational brands at the Best Brand Award... Details",
    "url": "https://www.dhakatribune.com/business/399256/ispahani-mirzapore-wins-%E2%80%98best-tea-brand%E2%80%99-for-11",
    "date": "Sun, 21 Dec 2025 18:20:24 +0600",
    "language": "en",
    "token_count": 62
  },
  {
    "doc_id": "en_000015",
    "title": "Walton again awarded BD’s best brand in refrigerators, ACs and TVs",
    "body": "Walton, a listed tech giant in the capital market, has once again won the honor of being the country's best refrigerator, AC (air conditioner) and television brand. The brand has won the 'Best Brand Award-2025' in 3 categories. Walton refrigerators, ACs and televisions have been awarded the 'Most Loved Brand of Bangladesh' award at the 17th edition of the Best Brand Awards organized by the... Details",
    "url": "https://www.dhakatribune.com/business/399248/walton-again-awarded-bd%E2%80%99s-best-brand-in",
    "date": "Sun, 21 Dec 2025 17:19:20 +0600",
    "language": "en",
    "token_count": 66
  },
  {
    "doc_id": "en_000016",
    "title": "NRB Bank holds 12th AGM",
    "body": "NRB Bank PLC successfully conducted its 12th annual general meeting (AGM), at which the shareholders approved the audited financial statements for the preceding year, declaration of dividend, appointment of the statutory auditors and corporate governance auditors for the year 2025 and fixation of their remuneration. The AGM was held in a hybrid format on December 18 at The Westin Dhaka, and... Details",
    "url": "https://www.dhakatribune.com/business/banks/399240/nrb-bank-holds-12th-agm",
    "date": "Sun, 21 Dec 2025 16:12:05 +0600",
    "language": "en",
    "token_count": 62
  },
  {
    "doc_id": "en_000017",
    "title": "HSBC opens biz dev office at Bepza EZ in Mirsharai",
    "body": "The Hongkong and Shanghai Banking Corporation Limited (HSBC) Bangladesh has inaugurated its new business development office (BDO) at the Bepza Economic Zone, Mirsharai, Chittagong. Through this business development office, HSBC will support both local and foreign investors operating in the zone, with access to HSBC’s international banking capabilities, supporting their trade, investment,... Details",
    "url": "https://www.dhakatribune.com/business/banks/399227/hsbc-opens-biz-dev-office-at-bepza-ez-in-mirsharai",
    "date": "Sun, 21 Dec 2025 12:28:39 +0600",
    "language": "en",
    "token_count": 53
  },
  {
    "doc_id": "en_000018",
    "title": "Golden blow: Bhori price climbs Tk80,000 in a year",
    "body": "The year 2025 was a year of instability, records, and surprises in the gold market of Bangladesh. While the price of the best quality 22-carat gold was a little over Tk138,000 per bhori at the end of December 2024, by mid-December 2025 the price of the same gold had crossed Tk217,000. That is, the price has increased by about 58-60% in a year. In just a year, the price per bhori has... Details",
    "url": "https://www.dhakatribune.com/business/399199/golden-blow-bhori-price-climbs-tk80-000-in-a-year",
    "date": "Sat, 20 Dec 2025 22:14:49 +0600",
    "language": "en",
    "token_count": 73
  },
  {
    "doc_id": "en_000019",
    "title": "Al-Arafah Islami Bank holds 446th board meeting",
    "body": "The 446th board meeting of Al-Arafah Islami Bank PLC was held on Thursday at the bank’s head office. Chairman of the board of directors Khwaja Shahriar presided over the meeting. The overall business performance of the Bank was reviewed and several policy decisions were taken at the meeting. Directors of the Bank Md Shahin Ul Islam, Md Abdul Wadud, Prof Mohammed Abu Eusuf, Mohammad... Details",
    "url": "https://www.dhakatribune.com/business/banks/399169/al-arafah-islami-bank-holds-446th-board-meeting",
    "date": "Sat, 20 Dec 2025 17:39:59 +0600",
    "language": "en",
    "token_count": 65
  },
  {
    "doc_id": "en_000020",
    "title": "Prime Bank, JBS Holdings to offer discounts on flat purchases",
    "body": "Prime Bank PLC has entered into a strategic partnership with JBS Holdings Limited, one of Bangladesh’s most reputed real estate developers, to offer exclusive discounts on flat purchases for its valued customers. A formal signing ceremony marking this collaboration was recently held at JBS Holdings head office in Dhaka. Under this agreement, Prime Bank customers will be able to enjoy... Details",
    "url": "https://www.dhakatribune.com/business/banks/399168/prime-bank-jbs-holdings-to-offer-discounts-on",
    "date": "Sat, 20 Dec 2025 17:30:02 +0600",
    "language": "en",
    "token_count": 61
  },
  {
    "doc_id": "en_000021",
    "title": "Covid-19 unable to weaken security-service industry despite impact",
    "body": "Having stepped into 35 years of security operations, The Bulwark Limited in a press release noted that the retired defence security personnel of the company had faced Covid-19 daringly in the past years. During the peak infestation, they ensured gate passes, in/out, and overall security in various factories and institutions were accounted for. However, while checking thousands of workers... Details",
    "url": "https://www.dhakatribune.com/business/399158/covid-19-unable-to-weaken-security-service",
    "date": "Sat, 20 Dec 2025 16:09:57 +0600",
    "language": "en",
    "token_count": 60
  },
  {
    "doc_id": "en_000022",
    "title": "NBR to digitalize monitoring Indian cargo trucks",
    "body": "The National Board of Revenue (NBR) has launched a new sub-module called 'Truck Movement' in the Asycuda World system to monitor the movement of cargo trucks coming from India more effectively and transparently. The NBR said that information related to the entry of every Indian cargo truck into the country and the return of empty trucks will now be stored electronically. Initially, the pilot... Details",
    "url": "https://www.dhakatribune.com/business/399031/nbr-to-intensify-monitoring-indian-cargo-trucks",
    "date": "Thu, 18 Dec 2025 18:58:35 +0600",
    "language": "en",
    "token_count": 65
  },
  {
    "doc_id": "en_000023",
    "title": "Mohd Rafat Ullah Khan new MD of Al-Arafah Islami Bank",
    "body": "Al-Arafah Islami Bank (AIB) PLC has appointed Mohd Rafat Ullah Khan as its managing director (MD). He was appointed to this position for a period of 3 years from December 18, 2025. Before joining this position, he was working as the additional managing director (AMD) and chief risk officer of the bank. Earlier, he served as the deputy managing director (DMD), CRO and CAMELCO of NCC Bank PLC.... Details",
    "url": "https://www.dhakatribune.com/business/399028/mohd-rafat-ullah-khan-new-md-of-al-arafah-islami",
    "date": "Thu, 18 Dec 2025 18:41:06 +0600",
    "language": "en",
    "token_count": 69
  },
  {
    "doc_id": "en_000024",
    "title": "Novo Nordisk Pharma, Arogga to enhance patient access to diabetes care in Bangladesh",
    "body": "Novo Nordisk Pharma (Private) Limited, a global leader in diabetes care and Arogga Limited, Bangladesh’s leading online pharmacy platform, have signed a Memorandum of Understanding (MoU) to collaborate on improving patient convenience and access to authentic Novo Nordisk products through digital channels. Under this collaboration, Arogga will provide online ordering and home delivery of... Details",
    "url": "https://www.dhakatribune.com/business/399027/novo-nordisk-pharma-arogga-to-enhance-patient",
    "date": "Thu, 18 Dec 2025 18:35:04 +0600",
    "language": "en",
    "token_count": 55
  },
  {
    "doc_id": "en_000025",
    "title": "Jica hosts workshop on UGDP",
    "body": "The Japan International Cooperation Agency Bangladesh on Wednesday hosted a dissemination workshop to showcase the achievements of the upazila governance and development project and outline strategies for strengthening local governance in Bangladesh. The event was graced by Mobasser Monem, chairman, Bangladesh Public Service Commission, as chief guest. Md Nazrul Islam, secretary,... Details",
    "url": "https://www.dhakatribune.com/business/399024/jica-hosts-workshop-on-ugdp",
    "date": "Thu, 18 Dec 2025 18:20:10 +0600",
    "language": "en",
    "token_count": 52
  },
  {
    "doc_id": "en_000026",
    "title": "BB governor: Will increase reserves to $35bn by current FY26",
    "body": "Bangladesh Bank has set a target to increase the country's foreign exchange reserves to $34-35 billion within the current FY26. For this, there is no need to take new loans from international lending institutions, said central bank governor Dr. Ahsan H Mansur. He made these remarks as the chief guest at a seminar titled “Banking Sector Reforms: Challenges and Ways Out” organized by the... Details",
    "url": "https://www.dhakatribune.com/business/banks/399014/bb-governor-will-increase-reserves-to-35bn-by",
    "date": "Thu, 18 Dec 2025 18:17:33 +0600",
    "language": "en",
    "token_count": 65
  },
  {
    "doc_id": "en_000027",
    "title": "Apex Footwear holds Annual Sales Conference 2025",
    "body": "Apex Footwear Limited on Tuesday held its Annual Sales Conference at the Samajik Convention Center in Ashulia, Dhaka. The full‑day event was attended by 1,500 members of the Apex family from across the country. The conference began with a heartfelt tribute to late founder chairman Syed Manzur Elahi, whose vision and leadership laid the foundation for over three decades of excellence in... Details",
    "url": "https://www.dhakatribune.com/business/399011/apex-footwear-holds-annual-sales-conference-2025",
    "date": "Thu, 18 Dec 2025 16:17:38 +0600",
    "language": "en",
    "token_count": 63
  },
  {
    "doc_id": "en_000028",
    "title": "Bangladesh Krishi Bank achieves ‘Remittance Award-2025’",
    "body": "Bangladesh Krishi Bank achieved the ‘Remittance Award-2025’ in recognition of securing fourth place in remittance collection for FY25. The program was organized on Wednesday by the Ministry of Expatriates’ Welfare and Overseas Employment on the occasion of International Migrants Day and National Expatriates’ Day 2025 while the Chief Adviser of the Interim Government Dr... Details",
    "url": "https://www.dhakatribune.com/business/banks/399010/bangladesh-krishi-bank-achieves-%E2%80%98remittance",
    "date": "Thu, 18 Dec 2025 16:14:39 +0600",
    "language": "en",
    "token_count": 55
  },
  {
    "doc_id": "en_000029",
    "title": "BB: Expedite resolution process in interest of depositors",
    "body": "Bangladesh Bank Governor Dr. Ahsan H Mansur has directed the board of directors of Sammilito Islami Bank PLC to expedite the resolution process quickly and effectively by giving top priority to the interests of depositors. The governor made this call at the first meeting of the bank's newly formed board of directors held at Bangladesh Bank's head office in Motijheel on Wednesday (December 17).... Details",
    "url": "https://www.dhakatribune.com/business/banks/398952/bb-expedite-resolution-process-in-interest-of",
    "date": "Wed, 17 Dec 2025 19:04:06 +0600",
    "language": "en",
    "token_count": 65
  },
  {
    "doc_id": "en_000030",
    "title": "Bank Asia, Incepta Pharma sign strategic agreement",
    "body": "Bank Asia PLC and Incepta Pharmaceuticals Limited have signed a strategic agreement to introduce an integrated cash management solution and strengthening the partnership between the two organizations. The signing ceremony was held on December 11 at head office of Incepta Pharmaceuticals Limited, Tejgaon, Dhaka. The agreement was signed by Nurullah Chaudhury, additional managing director &... Details",
    "url": "https://www.dhakatribune.com/business/banks/398951/bank-asia-incepta-pharma-sign-strategic-agreement",
    "date": "Wed, 17 Dec 2025 18:45:47 +0600",
    "language": "en",
    "token_count": 56
  },
  {
    "doc_id": "en_000031",
    "title": "University of Chittagong holds Youth Fest under IFIC Bank initiative",
    "body": "Under the directives of Bangladesh Bank and with the objective of raising awareness among the country’s young generation about banking activities, savings habits, and financial management, IFIC Bank PLC on December 7 organized a special financial literacy program at the University of Chittagong as part of Festival of Youth 2025. The festival was held at the University of Chittagong... Details",
    "url": "https://www.dhakatribune.com/business/banks/398949/university-of-chittagong-holds-youth-fest-under",
    "date": "Wed, 17 Dec 2025 18:43:52 +0600",
    "language": "en",
    "token_count": 60
  },
  {
    "doc_id": "en_000032",
    "title": "EBL Wins ICSB National Award for corporate governance excellence",
    "body": "Eastern Bank PLC (EBL) has been awarded the Silver Award in the General Banking category at the 12th ICSB National Award for Corporate Governance Excellence, held at Pan Pacific Sonargaon, Dhaka, on December 15. The award was received by Ali Reza Iftekhar, managing director of EBL, from Lutfey Siddiqi, special envoy on international affairs to the chief adviser, at a gala ceremony attended by... Details",
    "url": "https://www.dhakatribune.com/business/banks/398947/ebl-wins-icsb-national-award-for-corporate",
    "date": "Wed, 17 Dec 2025 18:39:19 +0600",
    "language": "en",
    "token_count": 65
  },
  {
    "doc_id": "en_000033",
    "title": "Southeast Bank holds Annual Risk Conference 2025",
    "body": "Southeast Bank PLC. organized “Annual Risk Conference-2025” in a hybrid format on December 13 at the Southeast Bank Training Institute, Dhaka. The conference was chaired by Md Khalid Mahmood Khan, managing director of Southeast Bank PLC, while ANM Moinul Kabir, director, Department of Off-site Supervision (DOS), Bangladesh Bank, graced the event as chief guest. Nazmin Nahar,... Details",
    "url": "https://www.dhakatribune.com/business/banks/398946/southeast-bank-holds-annual-risk-conference-2025",
    "date": "Wed, 17 Dec 2025 18:37:50 +0600",
    "language": "en",
    "token_count": 57
  },
  {
    "doc_id": "en_000034",
    "title": "Mainul Kabir joins SBAC Bank as MD & CEO",
    "body": "SM Mainul Kabir has joined SBAC Bank PLC as managing director & CEO on Wednesday. Before joining SBAC Bank, Kabir served as deputy managing director of United Commercial Bank PLC. Mainul Kabir brings over 30 years of distinguished and active experience in the banking industry. Throughout his career, he has held several senior leadership roles, including head of credit, chief business... Details",
    "url": "https://www.dhakatribune.com/business/banks/398945/mainul-kabir-joins-sbac-bank-as-md-ceo",
    "date": "Wed, 17 Dec 2025 18:33:25 +0600",
    "language": "en",
    "token_count": 62
  },
  {
    "doc_id": "en_000035",
    "title": "Currency exchange: Full value for torn notes if 90% is intact",
    "body": "If more than 90% of the torn, torn or dirty currency notes are intact, the customers will get the full value of the note back immediately. There will be an obligation to exchange such notes from any branch of any bank in the country. However, if 90% or less of a note exists, the exchange value of that note cannot be given immediately. In that case, the customer will have to apply and the... Details",
    "url": "https://www.dhakatribune.com/business/398942/currency-exchange-full-value-for-torn-notes-if",
    "date": "Wed, 17 Dec 2025 18:05:02 +0600",
    "language": "en",
    "token_count": 75
  },
  {
    "doc_id": "en_000036",
    "title": "Textile Talent Hunt unveils Season 10",
    "body": "Textile Talent Hunt (TTH) officially launched its Season 10 on Wednesday at Pan Pacific Sonargaon Dhaka. Marking a decade-long journey of inspiring talent, the new season is being introduced with the powerful motto “A Legacy of Innovation”, with sustainability set as the core focus. The launch event followed the successful conclusion of Textile Talent Hunt Season 9, which wrapped... Details",
    "url": "https://www.dhakatribune.com/business/398940/textile-talent-hunt-unveils-season-10",
    "date": "Wed, 17 Dec 2025 18:00:05 +0600",
    "language": "en",
    "token_count": 60
  },
  {
    "doc_id": "en_000037",
    "title": "JCI Bangladesh elects Arefeen Raafi Ahmed national president for 2026",
    "body": "Arefeen Raafi Ahmed has been elected National President of Junior Chamber International (JCI) Bangladesh for the year 2026, marking a new chapter of leadership for one of the country’s most prominent youth leadership organizations. The announcement was made at a program held at Hotel Radisson in Dhaka, where JCI leaders from across the country gathered to reaffirm their shared commitment... Details",
    "url": "https://www.dhakatribune.com/business/398937/jci-bangladesh-elects-arefeen-raafi-ahmed-national",
    "date": "Wed, 17 Dec 2025 17:46:21 +0600",
    "language": "en",
    "token_count": 61
  },
  {
    "doc_id": "en_000038",
    "title": "Arnob, Aupee Karim & Sarah Karim join hands with Berger to co-create illusions",
    "body": "Berger Paints Bangladesh Ltd has announced an exciting creative collaboration with three of the country’s most celebrated creative personalities—Arnob, Aupee Karim, and Sarah Karim—who will co-create exclusive Illusions for Berger, the brand’s premium textured painting service available through Berger Experience Zone outlets. Rooted in the belief that creativity... Details",
    "url": "https://www.dhakatribune.com/business/398936/arnob-aupee-karim-sarah-karim-join-hands-with",
    "date": "Wed, 17 Dec 2025 17:43:53 +0600",
    "language": "en",
    "token_count": 49
  },
  {
    "doc_id": "en_000039",
    "title": "Prime Bank signs payroll banking deal with Selise Bangladesh",
    "body": "Prime Bank PLC has recently signed Payroll Banking Agreement with Selise Bangladesh Limited, a leading software development company in Bangladesh, at the bank’s corporate office in Dhaka. Under this agreement, employees of Selise Bangladesh Limited will enjoy a range of exclusive banking benefits, including dual-currency debit card, customized loan and credit card facility, and... Details",
    "url": "https://www.dhakatribune.com/business/banks/398932/prime-bank-signs-payroll-banking-deal-with-selise",
    "date": "Wed, 17 Dec 2025 17:32:11 +0600",
    "language": "en",
    "token_count": 55
  },
  {
    "doc_id": "en_000040",
    "title": "Toyota Bangladesh to reshape new car driving experience",
    "body": "Premmit Singh, managing director of Toyota Bangladesh Limited, stated that in line with Toyota’s Global Vision “Be the Right ONE,” and as an integral part of the Toyota worldwide network, the company’s mission is to continually address the ever-changing needs of car enthusiasts. Accordingly, Toyota Bangladesh Limited will offer unprecedented added value to contribute to... Details",
    "url": "https://www.dhakatribune.com/business/398931/toyota-bangladesh-to-reshape-new-car-driving",
    "date": "Wed, 17 Dec 2025 17:29:43 +0600",
    "language": "en",
    "token_count": 56
  },
  {
    "doc_id": "en_000041",
    "title": "Walton observes founding chairman SM Nazrul Islam's 8th death anniversary",
    "body": "Wednesday marked the eighth death anniversary of SM Nazrul Islam, the pioneer of Bangladesh's electronics manufacturing industry and founding chairman of Walton Group. On the occasion of the eighth death anniversary, Milad Mahfil and special prayers were held at Walton's headquarters, corporate office, and Walton's service centers, plazas, and distributor showrooms nationwide on Wednesday to... Details",
    "url": "https://www.dhakatribune.com/business/398930/walton-observes-founding-chairman-sm-nazrul",
    "date": "Wed, 17 Dec 2025 17:27:18 +0600",
    "language": "en",
    "token_count": 56
  },
  {
    "doc_id": "en_000042",
    "title": "BB: Banks are responsible for returning depositors' money",
    "body": "Bangladesh Bank has clearly stated that the banks concerned will have to take responsibility for returning depositors' money from weak banks. It has also been informed that the central bank is not going to acquire any bank in this regard. Bangladesh Bank Executive Director and Spokesperson Arif Hossain Khan gave this information on Wednesday (December 17). He also said: \"The banks concerned... Details",
    "url": "https://www.dhakatribune.com/business/banks/398928/bb-banks-are-responsible-for-returning",
    "date": "Wed, 17 Dec 2025 16:58:59 +0600",
    "language": "en",
    "token_count": 63
  },
  {
    "doc_id": "en_000043",
    "title": "Elite Steel hosts MES delegation for technical visit, knowledge exchange",
    "body": "Elite Steel welcomed a high-level delegation of 32 officials from the Military Engineering Services (MES), led by Group Captain Colonel Iqbal Hossain, for a full-day technical visit to its industrial and corporate facilities. The program began at Elite Steel’s state-of-the-art rolling plant in Tongi, Gazipur, where the MES team was briefed on production workflows, quality assurance... Details",
    "url": "https://www.dhakatribune.com/business/398927/elite-steel-hosts-mes-delegation-for-technical",
    "date": "Wed, 17 Dec 2025 16:53:08 +0600",
    "language": "en",
    "token_count": 57
  },
  {
    "doc_id": "en_000044",
    "title": "Bajus names Sayem Sobhan Anvir as its chief adviser",
    "body": "The Bangladesh Jeweller's Association (Bajus) has appointed outgoing president Sayem Sobhan Anvir as its chief adviser. Enamul Haque Khan Dolon, proprietor of Diamond and Divas, has been elected president for a second term. The newly elected Board of Directors assumed power at an event held at the Bajus office in Eskaton, Dhaka on Monday. Afterwards, the first meeting of the new board was... Details",
    "url": "https://www.dhakatribune.com/business/398792/bajus-names-sayem-sobhan-anvir-as-its-chief",
    "date": "Mon, 15 Dec 2025 19:49:08 +0600",
    "language": "en",
    "token_count": 64
  },
  {
    "doc_id": "en_000045",
    "title": "BB governor: Money supply should increase naturally, not by printing more money",
    "body": "Bangladesh Bank Governor Ahsan H Mansur said that the financial sector has shrunk in the last few years due to huge money laundering from the country. At one time, the country's foreign exchange reserves were $48 billion, but they had fallen below $20 billion. Although the reserve situation has improved at present, if the economy is to grow sustainably, money supply should be increased not by... Details",
    "url": "https://www.dhakatribune.com/business/398791/money-supply-should-increase-naturally",
    "date": "Mon, 15 Dec 2025 19:38:13 +0600",
    "language": "en",
    "token_count": 67
  },
  {
    "doc_id": "en_000046",
    "title": "NBR: Mobile phone prices may drop",
    "body": "The government is ready to give tax breaks at both the production and import levels to reduce the price of mobile phones in the country, said National Board of Revenue (NBR) chairman Abdur Rahman Khan. He also said that this initiative is being taken to protect the interests of consumers and bring the market within a formal framework. He said these at a seminar titled “Socio-Economic... Details",
    "url": "https://www.dhakatribune.com/business/398790/nbr-mobile-phone-prices-may-drop",
    "date": "Mon, 15 Dec 2025 19:30:56 +0600",
    "language": "en",
    "token_count": 67
  },
  {
    "doc_id": "en_000047",
    "title": "RAK Ceramics Bangladesh retains Mehedi Hasan Miraz as brand ambassador for 2026-27",
    "body": "RAK Ceramics Bangladesh, a globally recognized leader in ceramic and gres porcelain wall tiles, floor tiles, countertops, and sanitaryware, has announced the renewal of Mehedi Hasan Miraz, captain of the Bangladesh National Cricket Team (ODI format), as its brand ambassador for 2026-2027. Mehedi Hasan Miraz has been associated with RAK Ceramics since 2021, and over the years has become a... Details",
    "url": "https://www.dhakatribune.com/business/398787/rak-ceramics-bangladesh-retains-mehedi-hasan-miraz",
    "date": "Mon, 15 Dec 2025 19:06:59 +0600",
    "language": "en",
    "token_count": 61
  },
  {
    "doc_id": "en_000048",
    "title": "Bata kicks off ‘Back to School’ campaign with exciting rewards",
    "body": "Bata Bangladesh has recently launched its ‘Back to School’ campaign, offering students and their parents a rewarding shopping experience filled with exciting offers as they prepare for the new school year. Running from December 1, 2025, to January 31, 2026, the campaign aims to bring a festive cheer to families preparing for the upcoming year while keeping quality footwear within... Details",
    "url": "https://www.dhakatribune.com/business/398786/bata-kicks-off-%E2%80%98back-to-school%E2%80%99-campaign-with",
    "date": "Mon, 15 Dec 2025 19:04:50 +0600",
    "language": "en",
    "token_count": 61
  },
  {
    "doc_id": "en_000049",
    "title": "Midland Bank aids Bengal Institute’s publication of architect Muzharul Islam’s memoir",
    "body": "Midland Bank Family provided financial assistance of Tk10 lakh to Bengal Institute for the comprehensive publication on the work and life of Architect Muzharul Islam. The bank provided Tk5 lakh financial assistance from its Islami Banking Fund under its Corporate Social Responsibilities (CSR) activity. Remaining Tk5 lakh was contributed by Midland Bank family members. Md Ahsan-uz Zaman,... Details",
    "url": "https://www.dhakatribune.com/business/banks/398771/midland-bank-aids-bengal-institute%E2%80%99s-publication",
    "date": "Mon, 15 Dec 2025 14:18:14 +0600",
    "language": "en",
    "token_count": 58
  },
  {
    "doc_id": "en_000050",
    "title": "UCB holds Townhalls across 16 regions with commitment to customer satisfaction",
    "body": "At the same time, on the same day, townhalls were held simultaneously across 16 regions of the country. In some regions, the bank’s chairman was present; in others, the managing director, AMDs, DMDs, and senior officials led the sessions. Such a coordinated, nationwide engagement with team members is a unique initiative in Bangladesh’s banking sector. United Commercial Bank PLC... Details",
    "url": "https://www.dhakatribune.com/business/banks/398768/ucb-holds-townhalls-across-16-regions-with",
    "date": "Mon, 15 Dec 2025 14:03:06 +0600",
    "language": "en",
    "token_count": 60
  },
  {
    "doc_id": "en_000051",
    "title": "Chevron Bangladesh-supported artificial limb support initiative concludes in Sylhet",
    "body": "The SMILE project, in collaboration with the Jalalabad Disabled Rehab Centre and Hospital (JDRCH), celebrated the closing ceremony of the Restoring Mobility: Artificial Limb Support intervention, held at Grand Sylhet. The event marked the successful provision of prosthetic and orthotic devices to 60 beneficiaries from Sylhet and Nabiganj upazilas, many of whom have lived with physical... Details",
    "url": "https://www.dhakatribune.com/business/398722/chevron-bangladesh-supported-artificial-limb",
    "date": "Sun, 14 Dec 2025 20:52:01 +0600",
    "language": "en",
    "token_count": 57
  },
  {
    "doc_id": "en_000052",
    "title": "Banglalink CEO Wins 'CEO of the Year' award",
    "body": "Banglalink won two awards at The Fast Mode Awards 2025. The company's Chief Executive Officer Johan Buse received the 'CEO of the Year' (Asia Pacific Region) award in recognition of his leadership excellence, while the company earned the 'Customer Experience (CX) Champion' award for its continued progress in enhancing customer experience. The Fast Mode Award, organized by The Fast Mode, a... Details",
    "url": "https://www.dhakatribune.com/business/398721/banglalink-ceo-wins-ceo-of-the-year-award",
    "date": "Sun, 14 Dec 2025 18:38:40 +0600",
    "language": "en",
    "token_count": 62
  },
  {
    "doc_id": "en_000053",
    "title": "BB’s Customer Awareness Week, CTG-2025 begins in Cox’s Bazar",
    "body": "Customer Awareness Week, Chittagong-2025 of Bangladesh Bank, commenced in Cox’s Bazar with the aim of enhancing banking awareness among customers. Executive Director of Bangladesh Bank Md Niamul Kabir attended the inauguration ceremony as the chief guest. The event, held on Saturday in Cox’s Bazar, was organized by the Financial Integrity and Customer Services Department of... Details",
    "url": "https://www.dhakatribune.com/business/banks/398718/bb%E2%80%99s-customer-awareness-week-ctg-2025-begins-in",
    "date": "Sun, 14 Dec 2025 18:11:39 +0600",
    "language": "en",
    "token_count": 56
  },
  {
    "doc_id": "en_000054",
    "title": "EBL signs payroll banking agreement with LZ Group",
    "body": "Eastern Bank PLC (EBL) has signed a payroll banking agreement with LZ Group, one of Bangladesh’s leading and rapidly expanding industrial conglomerates with a strong presence in the apparel and textile sector. Nurul Haque, CEO of LZ Group, and Ahmed Shaheen, additional managing director of EBL, signed the agreement on behalf of their respective organizations at EBL’s head office,... Details",
    "url": "https://www.dhakatribune.com/business/banks/398711/ebl-signs-payroll-banking-agreement-with-lz-group",
    "date": "Sun, 14 Dec 2025 17:36:01 +0600",
    "language": "en",
    "token_count": 60
  },
  {
    "doc_id": "en_000055",
    "title": "Premier Bank appoints Md Monzur Mofiz new AMD, MD (CC)",
    "body": "Md Monzur Mofiz has been appointed as additional managing director (AMD) of The Premier Bank PLC and has subsequently been entrusted with the responsibility of managing director (current charge), effective from December 14, 2025. A veteran banker with nearly 32 years of experience, Md Monzur Mofiz started his career in Sonali Bank PLC in 1993. Prior to joining Premier Bank, he served ONE... Details",
    "url": "https://www.dhakatribune.com/business/banks/398710/premier-bank-appoints-md-monzur-mofiz-new-amd-md",
    "date": "Sun, 14 Dec 2025 17:32:53 +0600",
    "language": "en",
    "token_count": 64
  },
  {
    "doc_id": "en_000056",
    "title": "HSBC facilitates sustainable finance for GP",
    "body": "The Hongkong and Shanghai Banking Corporation Limited (HSBC) and Grameenphone have recently collaborated to structure the first ever Sustainability-Linked Loan (SLL) in the Telecom Industry of Bangladesh, with HSBC being the sole arranger. The signing ceremony was held recently in presence of Yasir Azman, chief executive officer, Grameenphone, Md Mahbub ur Rahman, chief executive officer, HSBC... Details",
    "url": "https://www.dhakatribune.com/business/398709/hsbc-facilitates-sustainable-finance-for-gp",
    "date": "Sun, 14 Dec 2025 17:27:44 +0600",
    "language": "en",
    "token_count": 57
  },
  {
    "doc_id": "en_000057",
    "title": "Apex begins new era with Venturini, welcomes back fashion icon Noble",
    "body": "Venturini, a name synonymous with sophistication and modern elegance from the House of Apex, with 25 years of craftsmanship in leather shoes, debuted with the return of Bangladesh’s celebrated fashion icon, Nobel. After so many years away, Nobel’s timeless presence and commanding persona re-enter the spotlight, bringing an aura of prestige that aligns seamlessly with... Details",
    "url": "https://www.dhakatribune.com/business/398707/apex-begins-new-era-with-venturini-welcomes-back",
    "date": "Sun, 14 Dec 2025 17:22:10 +0600",
    "language": "en",
    "token_count": 56
  },
  {
    "doc_id": "en_000058",
    "title": "Potato Fest 2025 concludes",
    "body": "The closing ceremony of the two-day international exhibition titled “Potato Festival 2025”, organized by the Bangladesh Cold Storage Association (BCSA), was held at Hall No. 1 of the International Convention City Bashundhara (ICCB), Kuril, Dhaka on Saturday. The chief guest at the closing ceremony was Sheikh Bashir Uddin, Adviser, Ministry of Commerce. Special guest was Mahbubur... Details",
    "url": "https://www.dhakatribune.com/business/398645/potato-fest-2025-concludes",
    "date": "Sat, 13 Dec 2025 18:59:53 +0600",
    "language": "en",
    "token_count": 57
  },
  {
    "doc_id": "en_000059",
    "title": "6 customers win free Walton fridges, TVs",
    "body": "Walton's digital campaign is running nationwide to provide special benefits to customers when purchasing electronics products. In the 23rd season of the campaign, customers are getting free and guaranteed gifts of various products, including the latest technology side-by-side fridges, by purchasing Walton fridges, ACs, TVs, washing machines or BLDC fans. Walton is giving away free gifts to... Details",
    "url": "https://www.dhakatribune.com/business/398642/6-customers-win-free-walton-fridges-tvs",
    "date": "Sat, 13 Dec 2025 18:43:58 +0600",
    "language": "en",
    "token_count": 58
  },
  {
    "doc_id": "en_000060",
    "title": "Tobacco industry alarmed at Govt’s reluctance to allow stakeholder-inclusive consultation regarding Tobacco Control Act Amendment",
    "body": "Leading companies in the tobacco industry today issued a joint statement, expressing their serious concerns over the government’s attempt to pass the proposed amendment to the Tobacco Control Act without a stakeholder-inclusive consultation in the absence of appropriate Parliamentary process. Industry players believe that the proposed amendment will result in far-reaching, negative... Details",
    "url": "https://www.dhakatribune.com/business/398528/tobacco-industry-alarmed-at-govt%E2%80%99s-reluctance-to",
    "date": "Thu, 11 Dec 2025 21:48:25 +0600",
    "language": "en",
    "token_count": 53
  },
  {
    "doc_id": "en_000061",
    "title": "Experts: Economic stability risky without bank resolution regime",
    "body": "Experts at a discussion on Thursday said without the ability to execute orderly resolutions, manage failing banks efficiently, and protect depositors while minimizing systemic risks, the Banking Resolution Ordinance will remain a promise only on paper. The Policy Research Institute of Bangladesh (PRI), with support from the Foreign, Commonwealth & Development Office (FCDO), hosted a... Details",
    "url": "https://www.dhakatribune.com/business/398499/experts-economic-stability-risky-without-bank",
    "date": "Thu, 11 Dec 2025 18:19:55 +0600",
    "language": "en",
    "token_count": 56
  },
  {
    "doc_id": "en_000062",
    "title": "EcoFlow signs Ritu Porna Chakma as brand ambassador",
    "body": "EcoFlow, together with its exclusive and official distributor ACI Renewable Energy, officially signed national football star Ritu Porna Chakma as the brand’s new brand ambassador. The signing ceremony took place on Thursday at the Yamaha Flagship Centre, Tejgaon, Dhaka where Ritu Porna Chakma herself was present to formalize the partnership. Ritu Porna Chakma, one of Bangladesh’s... Details",
    "url": "https://www.dhakatribune.com/business/398495/ecoflow-signs-ritu-porna-chakma-as-brand",
    "date": "Thu, 11 Dec 2025 18:03:49 +0600",
    "language": "en",
    "token_count": 57
  },
  {
    "doc_id": "en_000063",
    "title": "Daraz 12.12: Grand year end sale goes live from December 11 at 8PM",
    "body": "Daraz Bangladesh is set to wrap up the year with a bang, announcing the return of the 12.12 Grand Year End Sale. The highly anticipated campaign will go live from Thursday (December 11) at 8 PM and continue until December 18, offering customers a final chance to grab their wish-list items with unbeatable offers and rewarding shopping experiences before the year ends. The campaign promises a... Details",
    "url": "https://www.dhakatribune.com/business/398493/daraz-12.12-grand-year-end-sale-goes-live-from",
    "date": "Thu, 11 Dec 2025 17:57:37 +0600",
    "language": "en",
    "token_count": 67
  },
  {
    "doc_id": "en_000064",
    "title": "Egg prices fall as production outpaces demand",
    "body": "Production rises sharply; farmers now selling at a loss Details",
    "url": "https://www.dhakatribune.com/business/398487/egg-prices-fall-as-production-outpaces-demand",
    "date": "Thu, 11 Dec 2025 17:10:10 +0600",
    "language": "en",
    "token_count": 10
  },
  {
    "doc_id": "en_000065",
    "title": "Deposit growth drops below 10% in October",
    "body": "The pace of deposit growth in the banking sector has slowed further, as it stood at 9.62% at the end of October, lower than 9.98% in September, and 10% in August. Bangladesh Bank released its latest figures on Wednesday. According to the data, the total deposit amount in the banking sector stood at Tk1,924,000 crore in October. This figure was Tk1,755,000 crore in the same period last year.... Details",
    "url": "https://www.dhakatribune.com/business/banks/398460/deposit-growth-drops-below-10%25-in-october",
    "date": "Thu, 11 Dec 2025 00:09:30 +0600",
    "language": "en",
    "token_count": 69
  },
  {
    "doc_id": "en_000066",
    "title": "BB eases capital machinery imports, bill payment exemption for up to 3 years",
    "body": "Bangladesh Bank has further simplified the rules for importing capital equipment to increase investment and capacity in the country's industrial sector. From now on, capital machinery required by industries can be imported on a three-year usance basis without prior permission from the bidder. Bangladesh Bank issued a circular in this regard on Wednesday (December 10). It said that this... Details",
    "url": "https://www.dhakatribune.com/business/banks/398458/bb-eases-capital-machinery-imports",
    "date": "Wed, 10 Dec 2025 23:51:36 +0600",
    "language": "en",
    "token_count": 60
  },
  {
    "doc_id": "en_000067",
    "title": "IFIC Bank donates computers, books at Begum Rokeya Girls’ High School",
    "body": "Under the initiative \"IFIC Bank Stand Beside Women in Tech Advancement,\" IFIC Bank is distributing computers to various educational institutions across the country. As part of this effort, on Wednesday, computers and books were distributed to the students of Begum Rokeya Girls' High School in Rangpur. The event was attended by Mohammed Mizanur Rahman, senior manager of the trade service... Details",
    "url": "https://www.dhakatribune.com/business/banks/398427/ific-bank-donates-computers-books-at-begum-rokeya",
    "date": "Wed, 10 Dec 2025 19:40:52 +0600",
    "language": "en",
    "token_count": 61
  },
  {
    "doc_id": "en_000068",
    "title": "Islami Bank holds board meeting",
    "body": "A meeting of the board of directors of Islami Bank Bangladesh PLC was held on Wednesday at the Islami Bank Tower. Prof M Zubaidur Rahman, chairman of the bank, presided over the meeting. Mohammad Khurshid Wahab, chairman of the executive committee, Md Abdus Salam, chairman of the audit committee, Prof M Masud Rahman, chairman of the risk management committee, Md Abdul Jalil, independent... Details",
    "url": "https://www.dhakatribune.com/business/banks/398426/islami-bank-holds-board-meeting",
    "date": "Wed, 10 Dec 2025 19:38:35 +0600",
    "language": "en",
    "token_count": 64
  },
  {
    "doc_id": "en_000069",
    "title": "Brac, MetLife Foundation strengthen youth employability, job access",
    "body": "Brac, in partnership with MetLife Foundation, has officially launched Career Hub in Rangpur, a one-stop platform aimed at supporting youth with the skills, guidance, and opportunities needed to succeed in today’s workforce. This initiative is designed to directly support 3,000 youth through career counselling, job- readiness training, climate awareness education, and meaningful employer... Details",
    "url": "https://www.dhakatribune.com/business/398425/brac-metlife-foundation-strengthen-youth",
    "date": "Wed, 10 Dec 2025 19:36:52 +0600",
    "language": "en",
    "token_count": 54
  },
  {
    "doc_id": "en_000070",
    "title": "AML wins big at Campaign’s Agency of the Year Awards 2025",
    "body": "Asiatic Mindshare Ltd (AML) has once again reinforced its leadership in the region by securing two prestigious recognitions at Campaign’s Agency of the Year Awards 2025. The agency secured Bronze in both the ‘Rest of South Asia Digital Innovation Agency of the Year’ and the ‘Rest of South Asia Media Agency of the Year’ categories—marking another milestone in... Details",
    "url": "https://www.dhakatribune.com/business/398424/aml-wins-big-at-campaign%E2%80%99s-agency-of-the-year",
    "date": "Wed, 10 Dec 2025 19:35:13 +0600",
    "language": "en",
    "token_count": 59
  },
  {
    "doc_id": "en_000071",
    "title": "Banglalink secures green light to launch digital payment services",
    "body": "Banglalink has received the no objection certificate from Bangladesh Bank to commence operations as a payment service provider. This marks a significant milestone in ensuring wider access to digital payments for everyone. Powered by a high-capacity technology platform and guided by its DO1440 strategy of empowering customers with relevant digital and financial services every minute of the... Details",
    "url": "https://www.dhakatribune.com/business/398414/banglalink-secures-green-light-to-launch-digital",
    "date": "Wed, 10 Dec 2025 18:05:10 +0600",
    "language": "en",
    "token_count": 58
  },
  {
    "doc_id": "en_000072",
    "title": "Park Avenue appoints Jamal Bhuiyan as brand ambassador in Bangladesh",
    "body": "Park Avenue Bangladesh has officially announced national football star and team captain Jamal Bhuiyan as its new brand ambassador. The signing ceremony took place on Wednesday in Dhaka, in the presence of Samir Suryawanshi, head of Saarc business, Godrej Consumer Products Limited—along with the Bangladesh management committee: Bhaskar Kumar Dey, head of marketing, Ritesh Barua, head of... Details",
    "url": "https://www.dhakatribune.com/business/398412/park-avenue-appoints-jamal-bhuiyan-as-brand",
    "date": "Wed, 10 Dec 2025 18:01:21 +0600",
    "language": "en",
    "token_count": 58
  },
  {
    "doc_id": "en_000073",
    "title": "Finance Adviser: VAT collected often does not reach state coffers",
    "body": "Interim government's Finance Adviser Dr Salehuddin Ahmed said that a significant portion of VAT collected in the country often does not reach the government treasury. He stressed on making the VAT system simpler and more transparent. He made these comments at a seminar on the occasion of “VAT Day and VAT Week-2025” organized by the National Board of Revenue (NBR) in Agargaon on... Details",
    "url": "https://www.dhakatribune.com/business/398394/finance-adviser-vat-collected-often-does-not",
    "date": "Wed, 10 Dec 2025 16:09:43 +0600",
    "language": "en",
    "token_count": 64
  },
  {
    "doc_id": "en_000074",
    "title": "Prime Bank customers to enjoy loan offer for BYD vehicles",
    "body": "Prime Bank PLC customers in Bangladesh will now enjoy exclusive offer on loan for purchasing BYD vehicles. CG Runner BD limited is the authorized distributor for BYD vehicles in Bangladesh. In this regard, an agreement was signed recently at BYD Bangladesh Flagship Showroom, Tejgaon in Dhaka. Under this partnership, if customers take a car loan from Prime Bank to purchase a BYD car, they can... Details",
    "url": "https://www.dhakatribune.com/business/banks/398393/prime-bank-customers-to-enjoy-loan-offer-for-byd",
    "date": "Wed, 10 Dec 2025 16:02:33 +0600",
    "language": "en",
    "token_count": 66
  },
  {
    "doc_id": "en_000075",
    "title": "bKash, BSK expand book reading program for students in Cox’s Bazar",
    "body": "In a continuous effort to cultivate reading habits among students, Bishwo Shahitto Kendro, in association with bKash, has expanded its nationwide book reading program to Cox’s Bazar district. This year, the program will distribute 40,000 books to 330 educational institutions across the country. As part of this program, a recent event was held at the BIAM Foundation auditorium in... Details",
    "url": "https://www.dhakatribune.com/business/398392/bkash-bsk-expand-book-reading-program-for",
    "date": "Wed, 10 Dec 2025 16:00:38 +0600",
    "language": "en",
    "token_count": 60
  },
  {
    "doc_id": "en_000076",
    "title": "Bank Asia holds AML, CFT awareness program for board, senior management",
    "body": "Bank Asia PLC organized an AML & CFT awareness program for its board of directors and senior management on December 8 at Bank Asia Tower, Karwan Bazar, Dhaka, with the objective of strengthening institutional knowledge and awareness on anti-money laundering (AML) and combating the financing of terrorism (CFT). Md Mofizur Rahman Khan Chowdhury, acting head of the Bangladesh Financial... Details",
    "url": "https://www.dhakatribune.com/business/banks/398366/bank-asia-holds-aml-cft-awareness-program-for",
    "date": "Tue, 09 Dec 2025 23:18:22 +0600",
    "language": "en",
    "token_count": 60
  },
  {
    "doc_id": "en_000077",
    "title": "BB buys $2.51bn from banks in FY26 so far",
    "body": "Bangladesh Bank has bought $2.51 billion from commercial banks so far in the current FY26. On Tuesday (December 9), the central bank bought another $202 million from 13 banks in a single day. The transaction was made at a rate of Tk122.27-Tk122.29 per dollar. The latest data from Bangladesh Bank says that the central bank has been buying dollars from the market since the start of the current... Details",
    "url": "https://www.dhakatribune.com/business/398328/bb-buys-2.51bn-from-banks-in-fy26-so-far",
    "date": "Tue, 09 Dec 2025 18:11:05 +0600",
    "language": "en",
    "token_count": 69
  },
  {
    "doc_id": "en_000078",
    "title": "NBR Chairman: Most companies still unregistered for VAT",
    "body": "Although the scope of business and commerce in the country is expanding rapidly, the number of VAT registered companies is still disappointingly low. National Board of Revenue (NBR) chairman Abdur Rahman Khan said that the main challenge in collecting VAT is that the VAT net is very limited. In fact, the majority of business companies in the country are still out of registration. He made... Details",
    "url": "https://www.dhakatribune.com/business/398327/nbr-chairman-most-companies-still-unregistered",
    "date": "Tue, 09 Dec 2025 18:08:50 +0600",
    "language": "en",
    "token_count": 66
  },
  {
    "doc_id": "en_000079",
    "title": "Midland Bank donates to Sajida Foundation for Korail slum fire relief",
    "body": "Midland Bank Family provided financial assistance of Tk10 lakh to Sajida Foundation, a charitable organization for Korail Slum Fire Relief. The bank provided Tk5 lakh financial assistance from its Islami Banking Fund under its CSR activity, as part of the bank’s commitment towards social wellbeing. Remaining Tk5 lakh was contributed by Midland Bank family members. Md Ahsan-uz Zaman,... Details",
    "url": "https://www.dhakatribune.com/business/banks/398326/midland-bank-donates-to-sajida-foundation-for",
    "date": "Tue, 09 Dec 2025 17:53:25 +0600",
    "language": "en",
    "token_count": 59
  },
  {
    "doc_id": "en_000080",
    "title": "Mercantile Bank holds AML, CFT training in Sylhet",
    "body": "Mercantile Bank PLC organized a comprehensive training program on ‘Prevention of Money Laundering & Combating Financing of Terrorism’ in Sylhet on December 6. The training was aimed at strengthening awareness and capacity among banking and financial professionals from the region. Executive Director of Bangladesh Bank Khaled Ahmed was the chief guest of the program and... Details",
    "url": "https://www.dhakatribune.com/business/banks/398325/mercantile-bank-holds-aml-cft-training-in-sylhet",
    "date": "Tue, 09 Dec 2025 17:43:37 +0600",
    "language": "en",
    "token_count": 56
  },
  {
    "doc_id": "en_000081",
    "title": "ONE Bank holds Town Hall Meet 2025, unveils new leadership",
    "body": "ONE Bank PLC hosted its Town Hall Meet 2025 in Gulshan, Dhaka, bringing together the bank’s leadership team and employees from across the country under the theme: “Together We Rise as ONE – Transform to Lead, Drive to Excel.” The session was led by the bank’s newly appointed managing director Muhit Rahman. In his opening remarks, ASM Shahidullah Khan, chairman of... Details",
    "url": "https://www.dhakatribune.com/business/banks/398324/one-bank-holds-town-hall-meet-2025-unveils-new",
    "date": "Tue, 09 Dec 2025 17:40:53 +0600",
    "language": "en",
    "token_count": 62
  },
  {
    "doc_id": "en_000082",
    "title": "Crowne Plaza Dhaka Gulshan introduces 1st Christmas tree made from recycled plastic",
    "body": "A heartwarming blend of creativity and corporate responsibility, Crowne Plaza Dhaka Gulshan has unveiled a unique Christmas tree designed entirely from 3688 onetime plastic bottles. Conceptualized and assembled by the hotel’s leadership team, the installation stands as a powerful representation of the theme “RRR – Reduce. Reuse. Revive.”, aligning strongly with... Details",
    "url": "https://www.dhakatribune.com/business/398323/crowne-plaza-dhaka-gulshan-introduces-1st",
    "date": "Tue, 09 Dec 2025 17:36:50 +0600",
    "language": "en",
    "token_count": 52
  },
  {
    "doc_id": "en_000083",
    "title": "NBR chairman: We are in a debt trap",
    "body": "Policymakers and economic experts have expressed concern over the country's debt situation. They have warned that if necessary reforms and fiscal discipline are not ensured in time, Bangladesh could fall into a serious debt trap. CPD distinguished fellow Prof Mostafizur Rahman said: \"If we cannot increase revenue collection and fail to control expenditure, it is inevitable for our country to... Details",
    "url": "https://www.dhakatribune.com/business/398268/nbr-chairman-we-are-in-a-debt-trap",
    "date": "Mon, 08 Dec 2025 21:17:35 +0600",
    "language": "en",
    "token_count": 61
  },
  {
    "doc_id": "en_000084",
    "title": "Banglalink launches Safety and Wellness Week 2025 with nationwide walkathon",
    "body": "Banglalink kicked off its annual Safety and Wellness Week 2025 on Saturday with a vibrant and high-spirited walkathon held simultaneously across Dhaka, Chittagong, Khulna, and Bogra. More than 560 employees participated, coming together in a shared commitment to health, safety, and overall well-being. This year’s theme, titled “Strength in Action, Care in Every Step,”... Details",
    "url": "https://www.dhakatribune.com/business/398256/banglalink-launches-safety-and-wellness-week-2025",
    "date": "Mon, 08 Dec 2025 18:54:51 +0600",
    "language": "en",
    "token_count": 55
  },
  {
    "doc_id": "en_000085",
    "title": "Prime Bank hosts launch of BB’s ‘Customer Awareness Week 2025’",
    "body": "Prime Bank PLC, in collaboration with Bangladesh Bank, recently organized the inaugural ceremony of ‘Customer Awareness Week 2025 (Dhaka Division)’ at the City Convention Hall in Kishoreganj. This event is organized under the theme ‘Building Awareness for Financial Security.’ The event was graced by Md Niamul Kabir, executive director of Bangladesh Bank, as chief... Details",
    "url": "https://www.dhakatribune.com/business/banks/398238/prime-bank-hosts-launch-of-bb%E2%80%99s-%E2%80%98customer",
    "date": "Mon, 08 Dec 2025 15:38:29 +0600",
    "language": "en",
    "token_count": 55
  },
  {
    "doc_id": "en_000086",
    "title": "Islami Bank at SME Fair with various services for entrepreneurs",
    "body": "Islami Bank Bangladesh PLC launched a stall at the 12th National SME Fair 2025, a seven-day event organized by the SME Foundation. Md Omar Faruk Khan, managing director of the bank, inaugurated the stall at the Bangladesh-China Friendship Conference Center on Sunday by cutting the ribbon. Abu Sayed Md Idris, senior executive vice president and head of SME Investment Wing; Md Mizanur Rahman... Details",
    "url": "https://www.dhakatribune.com/business/banks/398212/islami-bank-at-sme-fair-with-various-services-for",
    "date": "Mon, 08 Dec 2025 00:43:19 +0600",
    "language": "en",
    "token_count": 64
  },
  {
    "doc_id": "en_000087",
    "title": "Al-Arafah Islami Bank inaugurates stall at SME Product Fair",
    "body": "Al-Arafah Islami Bank participated in the 12th National SME Product Fair. Managing director (acting) of the bank Mohd Rafat Ullah Khan inaugurated the SME stall at the Bangladesh-China Friendship Conference Center on Sunday. During the inauguration, Md Rafat Ullah Khan said that the SME sector is playing an important role in enhancing the capacity of small and medium entrepreneurs in the... Details",
    "url": "https://www.dhakatribune.com/business/banks/398211/al-arafah-islami-bank-inaugurates-stall-at-sme",
    "date": "Mon, 08 Dec 2025 00:41:23 +0600",
    "language": "en",
    "token_count": 62
  },
  {
    "doc_id": "en_000088",
    "title": "Bank Asia holds workshop on transaction monitoring, early alert generation in Jessore",
    "body": "Bank Asia PLC, in collaboration with the Bangladesh Financial Intelligence Unit (BFIU), organized a daylong “Regional Workshop on Proactive Transaction Monitoring for Automated Early Alert Generation of Trade-Based Money Laundering” in Jessore on November 30. Ruman Ahamed, additional director of BFIU, attended the program as the key resource person, accompanied by Joint Directors... Details",
    "url": "https://www.dhakatribune.com/business/banks/398210/bank-asia-holds-workshop-on-transaction",
    "date": "Mon, 08 Dec 2025 00:38:55 +0600",
    "language": "en",
    "token_count": 54
  },
  {
    "doc_id": "en_000089",
    "title": "HSBC felicitates winners of ‘HSBC Export Excellence Awards 2025’",
    "body": "The Hongkong and Shanghai Banking Corporation Limited in Bangladesh on Sunday announced the winners of the “HSBC Export Excellence Awards 2025.” Four Bangladeshi businesses were recognized and honoured as ‘Exporter of the year’ for their leadership and continuous contribution in promoting Bangladesh in the global stage and enabling sustainable growth of the country. The HSBC Export... Details",
    "url": "https://www.dhakatribune.com/business/banks/398209/hsbc-felicitates-winners-of-%E2%80%98hsbc-export",
    "date": "Mon, 08 Dec 2025 19:03:20 +0600",
    "language": "en",
    "token_count": 57
  },
  {
    "doc_id": "en_000090",
    "title": "Kohinoor Chemical Company (BD) holds 38th AGM",
    "body": "The 38th Annual General Meeting (AGM) of Kohinoor Chemical Company (BD) Limited was held on Sunday on a digital platform. The AGM was held in presence of Md Rezaul Karim, managing director, Md Ebadul Karim, director, Prof Anwar Hossain, independent director, and Quazi Mamun-Ul-Asraf, independent director, Md Kamruzzaman, company secretary, and Mohd Shamim Kabir, chief financial officer (CFO)... Details",
    "url": "https://www.dhakatribune.com/business/398208/kohinoor-chemical-company-bd-holds-38th-agm",
    "date": "Sun, 07 Dec 2025 22:51:59 +0600",
    "language": "en",
    "token_count": 59
  },
  {
    "doc_id": "en_000091",
    "title": "Ambareen Reza ‘ICT Woman of the Year’ at 10th Brac Bank–The Daily Star ICT Awards",
    "body": "Ambareen Reza, managing director and co-founder of foodpanda Bangladesh, has been honored with the ICT Woman of the Year award at the 10th Brac Bank–The Daily Star ICT Awards, recognizing her transformative role in shaping Bangladesh’s digital landscape. Wahiduddin Mahmud, Planning Adviser to the Interim Government, attended the program as chief guest. The adviser highlighted... Details",
    "url": "https://www.dhakatribune.com/business/398197/ambareen-reza-%E2%80%98ict-woman-of-the-year%E2%80%99-at-10th-brac",
    "date": "Sun, 07 Dec 2025 19:37:45 +0600",
    "language": "en",
    "token_count": 56
  },
  {
    "doc_id": "en_000092",
    "title": "National SME Product Fair 2025 begins",
    "body": "The biggest annual event for domestic small and medium entrepreneurs—the 12th National SME Product Fair 2025—begun at the Bangladesh-China Friendship Conference Center in Agargaon in the capital on Sunday. Organized by the SME Foundation, the fair will continue until December 14. The government's Industries, Housing and Public Works Adviser Adilur Rahman Khan inaugurated it at the... Details",
    "url": "https://www.dhakatribune.com/business/398194/national-sme-product-fair-2025-begins",
    "date": "Sun, 07 Dec 2025 19:26:26 +0600",
    "language": "en",
    "token_count": 57
  },
  {
    "doc_id": "en_000093",
    "title": "Inflation rises again to 8.29% in November",
    "body": "In November this year, overall inflation in the country increased slightly to 8.29%. The rate in the previous month, October, was 8.17%. However, inflation has decreased significantly compared to the same month last year; in November 2024, the rate was 11.38%. This information is known from the latest report published by the Bangladesh Bureau of Statistics (BBS) on Sunday (December 7).... Details",
    "url": "https://www.dhakatribune.com/business/398193/inflation-rises-again-to-8.29%25-in-november",
    "date": "Sun, 07 Dec 2025 19:16:29 +0600",
    "language": "en",
    "token_count": 62
  },
  {
    "doc_id": "en_000094",
    "title": "NCC Bank Securities, ICB ink deal",
    "body": "A loan agreement has recently been signed between NCC Bank Securities and Financial Services Limited (NCCB Securities), a subsidiary company of NCC Bank, and the Investment Corporation of Bangladesh (ICB), under which ICB has approved a loan of Tk25 crore for NCCB Securities to invest in its own portfolio. This loan facility will play an important role in maintaining capital market stability... Details",
    "url": "https://www.dhakatribune.com/business/banks/398123/ncc-bank-securities-icb-ink-deal",
    "date": "Sat, 06 Dec 2025 18:17:11 +0600",
    "language": "en",
    "token_count": 63
  },
  {
    "doc_id": "en_000095",
    "title": "Eastern Bank launches ‘EBL Priority Next Gen’",
    "body": "Eastern Bank PLC (EBL) has unveiled EBL Priority Next Gen, a bespoke banking segment created for the next generation of achievers—young visionaries poised to carry forward the values, ambition and legacy of EBL’s Priority families at an exclusive launch evening at Sky Ballroom at Le Meridian, yesterday. EBL Priority Next Gen offers a thoughtfully curated suite of lifestyle... Details",
    "url": "https://www.dhakatribune.com/business/banks/398122/eastern-bank-launches-%E2%80%98ebl-priority-next-gen%E2%80%99",
    "date": "Sat, 06 Dec 2025 18:14:23 +0600",
    "language": "en",
    "token_count": 59
  },
  {
    "doc_id": "en_000096",
    "title": "Malaysia & Bangladesh Friendship Festival at InterContinental Dhaka",
    "body": "InterContinental Dhaka, the iconic luxury hotel by IHG, in association with the High Commission of Malaysia presents Malaysia & Bangladesh Friendship Festival at Elements Global Dining from December 4-13. The festival celebrates the warm bond between Malaysia and Bangladesh, showcased through the rich flavours and vibrant cultures. The inauguration ceremony of the exclusive festival took... Details",
    "url": "https://www.dhakatribune.com/business/398121/malaysia-bangladesh-friendship-festival-at",
    "date": "Sat, 06 Dec 2025 18:10:09 +0600",
    "language": "en",
    "token_count": 56
  },
  {
    "doc_id": "en_000097",
    "title": "Jamuna Bank launches 800C 5th subordinated bond",
    "body": "Jamuna Bank PLC introduced its 5th Subordinated Bond, designed to offer investors a secure, long-term investment with a highly attractive rate of return. The 7 years tenured principal amount will be redeemed in 5 equal annual installments, starting at the end of the 3rd year. This Tk800 crore bond has been structured in compliance with international standards and regulatory guidelines. It... Details",
    "url": "https://www.dhakatribune.com/business/banks/398119/jamuna-bank-launches-800c-5th-subordinated-bond",
    "date": "Sat, 06 Dec 2025 17:46:12 +0600",
    "language": "en",
    "token_count": 62
  },
  {
    "doc_id": "en_000098",
    "title": "Aarong announces ‘Winter Wonderland 2025: A Celebration of Crafts’",
    "body": "Aarong announced Winter Wonderland 2025: A Celebration of Crafts – a festive carnival celebrating the artisans and crafts behind Bangladesh’s rich craft heritage. The Aarong Tejgaon outlet this December will transform into a vibrant space where artisans, customers and communities come together to celebrate jamdani, nakshi kantha, hand embroidery, jewellery, rickshaw art and more.... Details",
    "url": "https://www.dhakatribune.com/business/398113/aarong-announces-%E2%80%98winter-wonderland-2025-a",
    "date": "Sat, 06 Dec 2025 16:57:16 +0600",
    "language": "en",
    "token_count": 55
  },
  {
    "doc_id": "en_000099",
    "title": "IAB roundtable urges preparedness over panic as growing earthquake risks rise",
    "body": "The Institute of Architects Bangladesh (IAB) held a roundtable discussion titled \"Earthquake: Reality, Perception, Awareness & Strategic Preparedness through Action\" at the IAB Center in Agargaon, Dhaka. The event brought together leading experts to address Bangladesh's earthquake vulnerability following recent seismic activities. Bangladesh recently experienced several earthquakes,... Details",
    "url": "https://www.dhakatribune.com/business/398112/iab-roundtable-urges-preparedness-over-panic-as",
    "date": "Sat, 06 Dec 2025 16:54:12 +0600",
    "language": "en",
    "token_count": 48
  }
]